public/depot.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-10 Wed 07:50 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Depot</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
<meta name="description" content="grtcdr's personal website, containing everything from his blog and résumé, to the scripts and configurations that power his system.">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li><a href="/index.html">Home</a></li>
  <li><a href="/contact.html">Contact</a></li>
  <li><a href="/data/resume.pdf">Résumé</a></li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Depot</h1>
</header><p>
The documentation found herein follows the <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a>
principle, it <i>does not</i> cover all of my configurations, so you are
invited to <a href="https://git.sr.ht/~grtcdr/dotfiles">browse the repository</a> where the rest of my dotfiles live.
</p>

<p>
This project was made possible thanks to the <a href="https://www.gnu.org/software/emacs/">Emacs</a> text editor, and
the <a href="https://orgmode.org/">Org Mode</a> ecosystem - this is not to say that a literate
programming implementation is exclusive to these two, but I happen to
like their integration and extensibility.
</p>

<p>
Please note that a small portion of my configurations may contain
something adapted from someone's <i>[a]</i> blog, <i>[b]</i> video demonstration
or <i>[c]</i> dotfiles.
</p>

<div id="outline-container-org3cb9c6f" class="outline-2">
<h2 id="org3cb9c6f">Explore</h2>
<div class="outline-text-2" id="text-org3cb9c6f">
<ul class="org-ul">
<li><p>
<a href="dotfiles/sway/sway.html">sway</a>
</p>

<p>
A concoction of functionalism and elegance, making use of the bare
minimum of software so as to achieve a coherent desktop environment
without one being present.
</p>

<ul class="org-ul">
<li><a href="dotfiles/sway/colorschemes.html">colorschemes</a></li>
<li><a href="dotfiles/swaylock/swaylock.html">swaylock</a></li>
<li><a href="dotfiles/mako/mako.html">mako</a></li>
</ul></li>

<li><p>
<a href="dotfiles/zsh/zsh.html">zsh</a>
</p>

<p>
A short <code>zsh</code> configuration targeting simplicity.
</p></li>

<li><p>
<a href="dotfiles/sh/doch.html">doch</a>
</p>

<p>
A shell script that lists and opens HTML/PDF files found within my
<code>org-directory</code>.
</p></li>

<li><p>
<a href="dotfiles/sh/startw.html">startw</a>
</p>

<p>
A shell script that intelligently starts <code>sway</code>, built with NVIDIA
GPUs in mind.
</p></li>

<li><p>
<a href="dotfiles/sh/mus.html">mus</a>
</p>

<p>
A shell script that automates the starting and stopping of <code>mpd</code> and
<code>ncmpcpp</code>.
</p></li>
</ul>
</div>
</div>
</div>
</body>
</html>
